In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from tabulate import tabulate

In [4]:
dataset = pd.read_csv('data.csv')
dataset

,Unnamed: 0,title,rating,name,num_ratings,num_reviews,num_followers,synopsis,genre
0,0,Sapiens: A Brief History of Humankind,4.39,Yuval Noah Harari,"8,06,229","46,149",30.5k,"100,000 years ago, at least six human species ...",history
1,1,"Guns, Germs, and Steel: The Fates of Human Soc...",4.04,Jared Diamond,"3,67,056","12,879","6,538","""Diamond has written a book of remarkable scop...",history
2,2,A People's History of the United States,4.07,Howard Zinn,"2,24,620","6,509","2,354","In the book, Zinn presented a different side o...",history
3,3,"The Devil in the White City: Murder, Magic, an...",3.99,Erik Larson,"6,13,157","36,644",64.2k,Author Erik Larson imbues the incredible event...,history
4,4,The Diary of a Young Girl,4.18,Anne Frank,"33,13,033","35,591","4,621",Discovered in the attic in which she spent the...,history
...,...,...,...,...,...,...,...,...,...
1534,1534,Hounded,4.09,Kevin Hearne,"83,827","7,203","11,905","Atticus O’Sullivan, last of the Druids, lives ...",fantasy
1535,1535,Charlie and the Chocolate Factory,4.15,Roald Dahl,"7,75,001","14,252","22,897",Charlie Bucket's wonderful adventure begins wh...,fantasy
1536,1536,Red Rising,4.25,Pierce Brown,"3,10,138","30,388","30,510","""I live for the dream that my children will be...",fantasy
1537,1537,Frostbite,4.26,Richelle Mead,"3,37,538","12,435","66,448","Rose loves Dimitri, Dimitri might love Tasha, ...",fantasy
1538,1538,Radiance,4.03,Grace Draven,"50,102","5,550","6,090","The Prince of no value\nBrishen Khaskem, princ...",fantasy

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1539 entries, 0 to 1538
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     1539 non-null   int64
 1   title          1539 non-null   object
 2   rating         1539 non-null   float64
 3   name           1539 non-null   object
 4   num_ratings    1539 non-null   object
 5   num_reviews    1539 non-null   object
 6   num_followers  1539 non-null   object
 7   synopsis       1539 non-null   object
 8   genre          1539 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 108.3+ KB

In [6]:
jumlah_record = len(dataset.index)
print("jumlah record", jumlah_record)

jumlah record 1539

In [7]:
Data_Atribut = list(dataset.columns)
Nama_Atribut = "\n".join(Data_Atribut)
print("nama atribut :\n", Nama_Atribut)

nama atribut :
 Unnamed: 0
title
rating
name
num_ratings
num_reviews
num_followers
synopsis
genre

In [9]:
Objek = len(dataset.dtypes[dataset.dtypes == 'object'])
print("jumlah atribut dengan tipe objek =", Objek)

jumlah atribut dengan tipe objek = 7

In [10]:
Int = len(dataset.dtypes[dataset.dtypes == 'int64'])
Float = len(dataset.dtypes[dataset.dtypes == 'float64'])
Angka = Int + Float
print("jumlah atribut dengan tipe angka =", Angka)

jumlah atribut dengan tipe angka = 2

In [11]:
Null = dataset.isnull().any().sum()
print("jumlah atribut yang memiliki nilai null =", Null)

jumlah atribut yang memiliki nilai null = 0

In [16]:
Dict = {
    "Jumlah Record"        : [jumlah_record],
    "Nama Atribut"         : [Nama_Atribut],
    "Atribut Tipe Object"  : [Objek],
    "Atribut Tipe Angka"   : [Angka],
    "Atribut Nilai Null"    : [Null],
}
tabel = pd.DataFrame(Dict)
print(tabulate(tabel, headers='keys', tablefmt='psql', showindex=False))

+-----------------+----------------+-----------------------+----------------------+----------------------+
|   Jumlah Record | Nama Atribut   |   Atribut Tipe Object |   Atribut Tipe Angka |   Atribut Nilai Null |
|-----------------+----------------+-----------------------+----------------------+----------------------|
|            1539 | Unnamed: 0     |                     7 |                    2 |                    0 |
|                 | title          |                       |                      |                      |
|                 | rating         |                       |                      |                      |
|                 | name           |                       |                      |                      |
|                 | num_ratings    |                       |                      |                      |
|                 | num_reviews    |                       |                      |                      |
|                 | num_followers  |                       |                      |                      |
|                 | synopsis       |                       |                      |                      |
|                 | genre          |                       |                      |                      |
+-----------------+----------------+-----------------------+----------------------+----------------------+

In [18]:
desc = dataset.describe()
desc.rename(index = {"count": "Jumlah Data", "Mean": "Rata-rata", "std": "Standar Deviasi", "Min": "Nilai Minimum", "25%": "Q1", "50%": "Q2", "75%": "Q3", "Max": "Nilai Maksimal"}, inplace = True)
desc

                  Unnamed: 0       rating
Jumlah Data      1539.000000  1539.000000
mean              769.000000     4.037518
Standar Deviasi   444.415346     0.225939
min                 0.000000     2.780000
Q1                384.500000     3.905000
Q2                769.000000     4.050000
Q3               1153.500000     4.180000
max              1538.000000     4.750000

In [22]:
dataset.corr()

            Unnamed: 0    rating
Unnamed: 0    1.000000  0.065867
rating        0.065867  1.000000

In [35]:
dataset['rating']*0.001

0       0.00439
1       0.00404
2       0.00407
3       0.00399
4       0.00418
         ...
1534    0.00409
1535    0.00415
1536    0.00425
1537    0.00426
1538    0.00403
Name: rating, Length: 1539, dtype: float64

In [26]:
numerics =['int64', 'float64']
number = dataset.select_dtypes(include=numerics).copy()
number.head(10)

   Unnamed: 0  rating
0           0    4.39
1           1    4.04
2           2    4.07
3           3    3.99
4           4    4.18
5           5    4.08
6           6    4.20
7           7    4.18
8           8    4.03
9           9    4.03

In [36]:
number.to_csv('data.csv')